{"post_stream":{"posts":[{"id":115380,"name":"Graham Morrison","username":"degville","avatar_template":"/user_avatar/forum.snapcraft.io/degville/{size}/2021_2.png","created_at":"2022-10-20T15:46:22.899Z","cooked":"\u003ch2\u003eWhy are snaps good for GTK4 applications?\u003c/h2\u003e\n\u003cp\u003eSnapcraft bundles necessary libraries required by the application, and can configure the environment for confinement of applications for end user peace of mind. Developers can ensure their application is delivered pre-packaged with libraries which will not be replaced or superseded by a distribution vendor.\u003c/p\u003e\n\u003cp\u003eHere are some snap advantages that will benefit many GTK4 applications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eSnaps are easy to discover and install\u003c/strong\u003e\nMillions of users can browse and install snaps graphically in the Ubuntu Software Center, the Snap Store or from the command-line.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eSnaps install and run the same across Linux\u003c/strong\u003e\nThey bundle the exact version of whatever is required, along with all of your app’s dependencies, be they binaries or system libraries.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eYou control the release schedule\u003c/strong\u003e\nYou decide when a new version of your application is released without having to wait for distributions to catch up.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eSnaps automatically update to the latest version\u003c/strong\u003e\nFour times a day, users’ systems will check for new versions and upgrade in the background.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eUpgrades are not disruptive\u003c/strong\u003e\nBecause upgrades are not in-place, users can keep your app open as it’s upgraded in the background.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eUpgrades are safe\u003c/strong\u003e\nIf your app fails to upgrade, users automatically roll back to the previous revision.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eBuild a snap in 20 minutes\u003c/h3\u003e\n\u003cp\u003eTypically this guide will take around 20 minutes and will result in a working GTK4 application in a snap. Once complete, you’ll understand how to package cutting edge GTK4 and GNOME 4 applications as snaps and deliver them to millions of Linux users. After making the snap available in the store, you’ll get access to installation metrics and tools to directly manage the delivery of updates to Linux users.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eⓘ For a brief overview of the snap creation process, including how to install \u003cem\u003esnapcraft\u003c/em\u003e and how it’s used, see \u003ca href=\"/t/snapcraft-overview/8940\"\u003eSnapcraft overview\u003c/a\u003e. For a more comprehensive breakdown of the steps involved, take a look at \u003ca href=\"/t/creating-a-snap/6799\"\u003eCreating a snap\u003c/a\u003e.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003ch2\u003eGetting started\u003c/h2\u003e\n\u003cp\u003eSnaps are defined in a single YAML file placed in the root folder of your project. The following example shows \u003ca href=\"https://github.com/ubuntu/gnome-text-editor/blob/stable/snap/snapcraft.yaml\"\u003ethe entire \u003cem\u003esnapcraft.yaml\u003c/em\u003e file for GNOME Text Editor\u003c/a\u003e. Don’t worry, we’ll break this down.\u003c/p\u003e\n\u003ch3\u003eGnome-Text-Editor Snap\u003c/h3\u003e\n\u003cp\u003eSnaps are defined in a single yaml file placed in the root of your project. The Gnome-Text-Editor example shows the entire snapcraft.yaml for an existing project. We’ll break this down.\u003c/p\u003e\n\u003cdetails\u003e\n\u003csummary\u003e\nsnapcraft.yaml for Text Editor\u003c/summary\u003e\n\u003cpre\u003e\u003ccode class=\"lang-yaml\"\u003ename: gnome-text-editor\ngrade: stable\nadopt-info: gnome-text-editor\nlicense: GPL-3.0+\n\nbase: core22\nconfinement: strict\n\napps:\n  gnome-text-editor:\n    extensions: [gnome]\n    command: usr/bin/gnome-text-editor\n    desktop: usr/share/applications/org.gnome.TextEditor.desktop\n    common-id: org.gnome.TextEditor.desktop\n    plugs:\n      - gsettings\n      - cups\n\nparts:\n  gnome-text-editor:\n    source: https://gitlab.gnome.org/GNOME/gnome-text-editor\n    source-tag: '42.2'\n    source-type: git\n    plugin: meson\n    meson-parameters:\n      - --prefix=/usr\n      - --buildtype=release\n    parse-info: [usr/share/metainfo/org.gnome.TextEditor.appdata.xml]\n\nslots:\n  gnome-text-editor:\n    interface: dbus\n    bus: session\n    name: org.gnome.TextEditor\n\u003c/code\u003e\u003c/pre\u003e\n\u003c/details\u003e\n\u003ch4\u003eMetadata\u003c/h4\u003e\n\u003cp\u003eThe \u003ccode\u003esnapcraft.yaml\u003c/code\u003e file starts with a small amount of human-readable metadata, which usually can be lifted from the GitHub description or project README.md. This data is used in the presentation of your app in the Snap Store.\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-yaml\"\u003ename: gnome-text-editor\ngrade: stable\nadopt-info: gnome-text-editor\nlicense: GPL-3.0+\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eThe \u003ccode\u003ename\u003c/code\u003e must be unique in the Snap Store. Valid snap names consist of lower-case alphanumeric characters and hyphens. They cannot be all numbers and they also cannot start or end with a hyphen.\u003c/p\u003e\n\u003cp\u003eYou can also fill in \u003ccode\u003etitle\u003c/code\u003e, \u003ccode\u003eversion\u003c/code\u003e, \u003ccode\u003esummary\u003c/code\u003e, \u003ccode\u003edescription\u003c/code\u003e and \u003ccode\u003eicon\u003c/code\u003e. However, Text Editor already has this metadata defined using an \u003ca href=\"https://www.freedesktop.org/wiki/Distributions/AppStream/\"\u003eAppStream\u003c/a\u003e metadata file \u003ccode\u003eorg.gnome.TextEditor.appdata.xml\u003c/code\u003e, so we don’t want to duplicate this data. We instead use \u003ca href=\"/t/using-external-metadata/4642\"\u003eadopt-info\u003c/a\u003e to tell Snapcraft to get the metadata from the \u003ccode\u003egnome-text-editor\u003c/code\u003e part further on in the yaml. More on this later.\u003c/p\u003e\n\u003ch4\u003eBase\u003c/h4\u003e\n\u003cp\u003eThe \u003ca href=\"/t/base-snaps/11198\"\u003ebase\u003c/a\u003e keyword defines a special kind of snap that provides a run-time environment with a minimal set of libraries that are common to most applications. They’re transparent to users, but they need to be considered, and specified, when building a snap.\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-yaml\"\u003ebase: core22\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003e\u003ca href=\"https://snapcraft.io/core22\"\u003e\u003ccode\u003ecore22\u003c/code\u003e\u003c/a\u003e is latest standard base for snap building and is built on \u003ca href=\"http://releases.ubuntu.com/22.04/\"\u003eUbuntu 22.04 LTS\u003c/a\u003e.\u003c/p\u003e\n\u003ch4\u003eSecurity model\u003c/h4\u003e\n\u003cp\u003eWe’re going to use \u003cem\u003estrict\u003c/em\u003e \u003ca href=\"/t/snap-confinement/6233\"\u003econfinement\u003c/a\u003e for Text Editor. Strictly confined snaps run in complete isolation, up to a minimal access level that’s deemed always safe.\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-yaml\"\u003econfinement: strict\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eUnconfined applications, specified with \u003ccode\u003edevmode\u003c/code\u003e, are useful while you build a working snap. Devmode snaps cannot be released to the stable channel, do not appear in search results, and do not automatically refresh. But after you get the snap working in \u003ccode\u003edevmode\u003c/code\u003e confinement, you can switch to strict mode and figure out which interfaces (plugs) the snap uses.\u003c/p\u003e\n\u003ch4\u003eApps\u003c/h4\u003e\n\u003cp\u003eApps are the commands and services exposed to end users. If your command name matches the snap \u003ccode\u003ename\u003c/code\u003e, users will be able run the command directly. If the names differ, then apps are prefixed with the snap \u003ccode\u003ename\u003c/code\u003e (\u003ccode\u003egnome-text-editor.command-name\u003c/code\u003e, for example). This is to avoid conflicting with apps defined by other installed snaps.\u003c/p\u003e\n\u003cp\u003eIf you don’t want your command prefixed you can request an alias for it on the \u003ca href=\"https://forum.snapcraft.io/t/process-for-reviewing-aliases-auto-connections-and-track-requests/455\"\u003eSnapcraft forum\u003c/a\u003e. These are set up automatically when your snap is installed from the Snap Store.\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-yaml\"\u003eapps:\n  gnome-text-editor:\n    extensions: [gnome]\n    command: usr/bin/gnome-text-editor\n    desktop: usr/share/applications/org.gnome.TextEditor.desktop\n    common-id: org.gnome.TextEditor.desktop\n    plugs:\n      - gsettings\n      - cups\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eThis application uses the \u003ca href=\"/t/the-gnome-extension/31449\"\u003egnome extension\u003c/a\u003e. This will make GTK4 and GNOME libraries available to the snap at runtime. It will also configure the runtime environment of the application so that all desktop functionality is correctly initialised.\u003c/p\u003e\n\u003cp\u003eThe \u003ccode\u003ecommon-id\u003c/code\u003e property is used to link this application to the AppStream metadata specified further down below. This will cause this \u003ccode\u003eapp\u003c/code\u003e to use the \u003ccode\u003e.desktop\u003c/code\u003e launcher specified in the AppStream file.\u003c/p\u003e\n\u003cp\u003eSnaps use interfaces to access resources outside of their confinement and an interface consists of a connection between a slot and a plug. The slot is the provider of the interface while the plug is the consumer. With the \u003ccode\u003eplugs:\u003c/code\u003e section, Text Editor is requesting access to the \u003ca href=\"/t/the-gsettings-interface/7832\"\u003egsettings\u003c/a\u003e and \u003ca\u003ecups\u003c/a\u003e interfaces to enable access to GNOME’s configuration and any configured printers.\u003c/p\u003e\n\u003ch4\u003eParts\u003c/h4\u003e\n\u003cp\u003eParts define how to build your app. Parts can be anything: programs, libraries, or other assets needed to create and run your application. In this case, we’re only using one to define the GitLab repository containing the GNOME Text Editor source code and how it’s to be built. In other cases these can point to local directories, local archives, other remote git repositories and other revision control systems.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"/t/the-meson-plugin/8623\"\u003eThe Meson plugin\u003c/a\u003e is used to run \u003ccode\u003emeson\u003c/code\u003e, \u003ccode\u003eninja build\u003c/code\u003e and \u003ccode\u003eninja install\u003c/code\u003e to build the part, and we pass a couple of options to set the install location within the snap, and for which release we wish to build:\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-yaml\"\u003eparts:\n  gnome-text-editor:\n    source: https://gitlab.gnome.org/GNOME/gnome-text-editor\n    source-tag: '42.2'\n    source-type: git\n    plugin: meson\n    meson-parameters:\n      - --prefix=/usr\n      - --buildtype=release\n    parse-info: [usr/share/metainfo/org.gnome.TextEditor.appdata.xml]\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003e\u003ccode\u003eparse-info\u003c/code\u003e points to the AppStream metadata file. Since we used \u003ccode\u003eadopt-info: gnome-text-editor\u003c/code\u003e in the top-level metadata, the AppStream file of the \u003ccode\u003egnome-text-editor\u003c/code\u003e part will be used to fill in the \u003ccode\u003esummary\u003c/code\u003e, \u003ccode\u003edescription\u003c/code\u003e and \u003ccode\u003eicon\u003c/code\u003e of this snap. See \u003ca href=\"/t/using-external-metadata/4642#heading--appstream\"\u003eUsing AppStream metadata\u003c/a\u003e for more information.\u003c/p\u003e\n\u003ch3\u003eSlots\u003c/h3\u003e\n\u003cp\u003eMany GTK3 and GTK4 applications require access to DBus in order to run correctly. However, snap blocks this access by default so you need to explicitly define that this application is allowed access to dbus.\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-yaml\"\u003eslots:\n  gnome-text-editor:\n    interface: dbus\n    bus: session\n    name: org.gnome.TextEditor\n\u003c/code\u003e\u003c/pre\u003e\n\u003ch3\u003eBuilding the snap\u003c/h3\u003e\n\u003cp\u003eTo build the snap, create a new directory and run \u003ccode\u003esnapcraft init\u003c/code\u003e inside it. This will create a template snapcraft.yaml inside a snap directory:\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-bash\"\u003e$ mkdir gnome-text-editor\n$ cd gnome-text-editor\n$ snapcraft init\nCreated snap/snapcraft.yaml.\nGo to https://docs.snapcraft.io/the-snapcraft-format/8337 for more information about the snapcraft.yaml format.\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eReplace the contents of \u003cstrong\u003esnap/snapcraft.yaml\u003c/strong\u003e with our example above. You can now build the snap by running the \u003cem\u003esnapcraft\u003c/em\u003e command:\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-bash\"\u003e$ snapcraft\nLaunching instance...                                                                                                                           \nExecuted: pull gnome-text-editor                                                                                                                \nExecuted: pull gnome/sdk                                                                                                                        \nExecuted: overlay gnome-text-editor                                                                                                             \nExecuted: overlay gnome/sdk                                                                                                                     \nExecuted: build gnome-text-editor                                                                                                               \nExecuted: build gnome/sdk                                                                                                                       \nExecuted: stage gnome-text-editor                                                                                                               \nExecuted: stage gnome/sdk                                                                                                                       \nExecuted: prime gnome-text-editor                                                                                                               \nExecuted: prime gnome/sdk                                                                                                                       \nExecuted parts lifecycle                                                                                                                        \nGenerated snap metadata                                                                                                                         \nCreated snap package gnome-text-editor_42.1_amd64.snap\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eThe resulting snap can be installed locally. This requires the \u003ccode\u003e--dangerous\u003c/code\u003e flag because the snap is not signed by the Snap Store. If we’d built the snap with \u003cem\u003edevmode\u003c/em\u003e confinement, we’d also have to add the \u003ccode\u003e--devmode\u003c/code\u003e flag:\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-bash\"\u003e$  sudo snap install ./gnome-text-editor*.snap --dangerous\ngnome-text-editor 42.1 installed\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eYou can then try it out:\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-bash\"\u003e$ gnome-text-editor\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eRemoving the snap is simple too:\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-bash\"\u003e$  sudo snap remove gnome-text-editor\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eYou can clean up the build environment with the following command:\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-bash\"\u003e$ snapcraft clean\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eBy default, when you make a change to snapcraft.yaml, snapcraft only builds the parts that have changed. Cleaning a build, however, forces your snap to be rebuilt in a clean environment and will take longer.\u003c/p\u003e\n\u003ch2\u003ePublishing your snap\u003c/h2\u003e\n\u003cp\u003eTo share your snaps you need to publish them in the Snap Store. First, create an account on \u003ca href=\"https://dashboard.snapcraft.io/dev/account/\"\u003ethe dashboard\u003c/a\u003e. Here you can customise how your snaps are presented, review your uploads and control publishing.\u003c/p\u003e\n\u003cp\u003eYou’ll need to choose a unique “developer namespace” as part of the account creation process. This name will be visible by users and associated with your published snaps.\u003c/p\u003e\n\u003cp\u003eMake sure the \u003ccode\u003esnapcraft\u003c/code\u003e command is authenticated using the email address attached to your Snap Store account:\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-bash\"\u003e$ snapcraft login\n\u003c/code\u003e\u003c/pre\u003e\n\u003ch3\u003eReserve a name for your snap\u003c/h3\u003e\n\u003cp\u003eYou can publish your own version of a snap, provided you do so under a name you have rights to. You can register a name on \u003ca href=\"https://dashboard.snapcraft.io/register-snap/\"\u003edashboard.snapcraft.io\u003c/a\u003e, or by running the following command:\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-bash\"\u003e$ snapcraft register mysnap\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eBe sure to update the \u003ccode\u003ename:\u003c/code\u003e in your \u003ccode\u003esnapcraft.yaml\u003c/code\u003e to match this registered name, then run \u003ccode\u003esnapcraft\u003c/code\u003e again.\u003c/p\u003e\n\u003ch3\u003eUpload your snap\u003c/h3\u003e\n\u003cp\u003eUse snapcraft to push the snap to the Snap Store.\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-bash\"\u003e$ snapcraft upload --release=edge mysnap_*.snap\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eIf you’re happy with the result, you can commit the snapcraft.yaml to your GitHub repo and \u003ca href=\"https://build.snapcraft.io\"\u003eturn on automatic builds\u003c/a\u003e so any further commits automatically get released to edge, without requiring you to manually build locally.\u003c/p\u003e\n\u003cp\u003eCongratulations! You’ve just built and published your first GTK 4 snap. For a more in-depth overview of the snap building process, see \u003ca href=\"/t/creating-a-snap/6799\"\u003eCreating a snap\u003c/a\u003e.\u003c/p\u003e","post_number":1,"post_type":1,"updated_at":"2023-04-30T02:53:12.472Z","reply_count":0,"reply_to_post_number":null,"quote_count":0,"incoming_link_count":39,"reads":16,"readers_count":15,"score":188.2,"yours":false,"topic_id":32266,"topic_slug":"gtk4-applications","display_username":"Graham Morrison","primary_group_name":null,"primary_group_flair_url":null,"primary_group_flair_bg_color":null,"primary_group_flair_color":null,"version":2,"can_edit":false,"can_delete":false,"can_recover":false,"can_wiki":false,"link_counts":[{"url":"https://forum.snapcraft.io/t/creating-a-snap/6799","internal":true,"reflection":false,"title":"Creating a snap","clicks":1},{"url":"https://github.com/ubuntu/gnome-text-editor/blob/stable/snap/snapcraft.yaml","internal":false,"reflection":false,"clicks":1},{"url":"https://dashboard.snapcraft.io/dev/account/","internal":false,"reflection":false,"clicks":1},{"url":"https://dashboard.snapcraft.io/register-snap/","internal":false,"reflection":false,"clicks":0},{"url":"https://forum.snapcraft.io/t/the-meson-plugin/8623","internal":true,"reflection":false,"title":"The meson plugin","clicks":0},{"url":"https://forum.snapcraft.io/t/the-gsettings-interface/7832","internal":true,"reflection":false,"title":"The gsettings interface","clicks":0},{"url":"https://forum.snapcraft.io/t/the-gnome-extension/31449","internal":true,"reflection":false,"title":"The gnome extension","clicks":0},{"url":"https://forum.snapcraft.io/t/process-for-aliases-auto-connections-and-tracks/455","internal":true,"reflection":false,"title":"Process for aliases, auto-connections and tracks","clicks":0},{"url":"https://forum.snapcraft.io/t/snap-confinement/6233","internal":true,"reflection":false,"title":"Snap confinement","clicks":0},{"url":"http://releases.ubuntu.com/22.04/","internal":false,"reflection":false,"title":"Ubuntu 22.04.1 LTS (Jammy Jellyfish)","clicks":0},{"url":"https://snapcraft.io/core22","internal":false,"reflection":false,"title":"Install core22 on Linux | Snap Store","clicks":0},{"url":"https://forum.snapcraft.io/t/base-snaps/11198","internal":true,"reflection":false,"title":"Base snaps","clicks":0},{"url":"https://forum.snapcraft.io/t/using-external-metadata/4642","internal":true,"reflection":false,"title":"Using external metadata","clicks":0},{"url":"https://forum.snapcraft.io/t/snapcraft-overview/8940","internal":true,"reflection":false,"title":"Snapcraft overview","clicks":0},{"url":"https://www.freedesktop.org/wiki/Distributions/AppStream/","internal":false,"reflection":false,"clicks":0},{"url":"https://build.snapcraft.io","internal":false,"reflection":false,"clicks":0},{"url":"https://forum.snapcraft.io/t/gtk3-applications/13483/3","internal":true,"reflection":true,"title":"GTK3 applications","clicks":1},{"url":"https://forum.snapcraft.io/t/snap-documentation/11127","internal":true,"reflection":true,"title":"Snap documentation","clicks":0}],"read":true,"user_title":null,"bookmarked":false,"actions_summary":[],"moderator":true,"admin":true,"staff":true,"user_id":2772,"hidden":false,"trust_level":4,"deleted_at":null,"user_deleted":false,"edit_reason":null,"can_view_edit_history":true,"wiki":true,"last_wiki_edit":"2023-04-30T02:53:12.539Z","can_accept_answer":false,"can_unaccept_answer":false,"accepted_answer":false},{"id":122992,"name":"","username":"SamAlex","avatar_template":"/user_avatar/forum.snapcraft.io/samalex/{size}/9155_2.png","created_at":"2023-04-30T02:56:00.562Z","cooked":"\u003cp\u003eEdited few things like this doc still had foliate and gtk 3 everywhere\u003c/p\u003e","post_number":2,"post_type":1,"updated_at":"2023-04-30T02:56:00.562Z","reply_count":1,"reply_to_post_number":null,"quote_count":0,"incoming_link_count":0,"reads":5,"readers_count":4,"score":6.0,"yours":false,"topic_id":32266,"topic_slug":"gtk4-applications","display_username":"","primary_group_name":null,"primary_group_flair_url":null,"primary_group_flair_bg_color":null,"primary_group_flair_color":null,"version":1,"can_edit":false,"can_delete":false,"can_recover":false,"can_wiki":false,"read":true,"user_title":null,"bookmarked":false,"actions_summary":[],"moderator":false,"admin":false,"staff":false,"user_id":13169,"hidden":false,"trust_level":2,"deleted_at":null,"user_deleted":false,"edit_reason":null,"can_view_edit_history":true,"wiki":false,"can_accept_answer":false,"can_unaccept_answer":false,"accepted_answer":false},{"id":123060,"name":"Graham Morrison","username":"degville","avatar_template":"/user_avatar/forum.snapcraft.io/degville/{size}/2021_2.png","created_at":"2023-05-02T08:10:16.531Z","cooked":"\u003cp\u003eThanks for spotting those errors and taking the trouble to fix them!\u003c/p\u003e","post_number":3,"post_type":1,"updated_at":"2023-05-02T08:10:16.531Z","reply_count":0,"reply_to_post_number":2,"quote_count":0,"incoming_link_count":0,"reads":2,"readers_count":1,"score":0.4,"yours":false,"topic_id":32266,"topic_slug":"gtk4-applications","display_username":"Graham Morrison","primary_group_name":null,"primary_group_flair_url":null,"primary_group_flair_bg_color":null,"primary_group_flair_color":null,"version":1,"can_edit":false,"can_delete":false,"can_recover":false,"can_wiki":false,"read":true,"user_title":null,"reply_to_user":{"username":"SamAlex","avatar_template":"/user_avatar/forum.snapcraft.io/samalex/{size}/9155_2.png"},"bookmarked":false,"actions_summary":[],"moderator":true,"admin":true,"staff":true,"user_id":2772,"hidden":false,"trust_level":4,"deleted_at":null,"user_deleted":false,"edit_reason":null,"can_view_edit_history":true,"wiki":false,"can_accept_answer":false,"can_unaccept_answer":false,"accepted_answer":false}],"stream":[115380,122992,123060]},"timeline_lookup":[[1,238],[2,47],[3,45]],"suggested_topics":[{"id":34730,"title":".NET apps","fancy_title":".NET apps","slug":"net-apps","posts_count":2,"reply_count":0,"highest_post_number":2,"image_url":null,"created_at":"2023-04-13T17:19:06.288Z","last_posted_at":"2023-05-29T06:08:55.544Z","bumped":true,"bumped_at":"2023-05-29T06:08:55.544Z","archetype":"regular","unseen":false,"pinned":false,"unpinned":null,"visible":true,"closed":false,"archived":false,"bookmarked":null,"liked":null,"tags":[],"like_count":3,"views":300,"category_id":15,"featured_link":null,"has_accepted_answer":false,"posters":[{"extras":null,"description":"Original Poster","user":{"id":14372,"username":"mateus-morais","name":"Mateus Rodrigues de Morais","avatar_template":"/user_avatar/forum.snapcraft.io/mateus-morais/{size}/9752_2.png"}},{"extras":"latest","description":"Most Recent Poster","user":{"id":14625,"username":"vvavrychuk","name":"Vasyl Vavrychuk","avatar_template":"/user_avatar/forum.snapcraft.io/vvavrychuk/{size}/9864_2.png"}}]},{"id":30905,"title":"Snapcraft documentation","fancy_title":"Snapcraft documentation","slug":"snapcraft-documentation","posts_count":1,"reply_count":0,"highest_post_number":1,"image_url":null,"created_at":"2022-07-15T11:05:45.374Z","last_posted_at":"2022-07-15T11:05:45.528Z","bumped":true,"bumped_at":"2023-02-17T19:55:21.024Z","archetype":"regular","unseen":false,"pinned":false,"unpinned":null,"visible":true,"closed":false,"archived":false,"bookmarked":null,"liked":null,"tags":[],"like_count":0,"views":1532,"category_id":15,"featured_link":null,"has_accepted_answer":false,"posters":[{"extras":"latest single","description":"Original Poster, Most Recent Poster","user":{"id":2772,"username":"degville","name":"Graham Morrison","avatar_template":"/user_avatar/forum.snapcraft.io/degville/{size}/2021_2.png"}}]},{"id":31049,"title":"Snapcraft How-to guides","fancy_title":"Snapcraft How-to guides","slug":"snapcraft-how-to-guides","posts_count":1,"reply_count":0,"highest_post_number":1,"image_url":null,"created_at":"2022-07-27T10:34:11.548Z","last_posted_at":"2022-07-27T10:34:11.663Z","bumped":true,"bumped_at":"2023-04-05T08:45:13.573Z","archetype":"regular","unseen":false,"pinned":false,"unpinned":null,"visible":true,"closed":false,"archived":false,"bookmarked":null,"liked":null,"tags":[],"like_count":0,"views":1200,"category_id":15,"featured_link":null,"has_accepted_answer":false,"posters":[{"extras":"latest single","description":"Original Poster, Most Recent Poster","user":{"id":2772,"username":"degville","name":"Graham Morrison","avatar_template":"/user_avatar/forum.snapcraft.io/degville/{size}/2021_2.png"}}]},{"id":31214,"title":"ROS 2 shared memory in snaps","fancy_title":"ROS 2 shared memory in snaps","slug":"ros-2-shared-memory-in-snaps","posts_count":3,"reply_count":1,"highest_post_number":3,"image_url":null,"created_at":"2022-08-09T13:28:52.600Z","last_posted_at":"2022-08-23T09:55:20.580Z","bumped":true,"bumped_at":"2022-08-23T09:55:20.580Z","archetype":"regular","unseen":false,"pinned":false,"unpinned":null,"visible":true,"closed":false,"archived":false,"bookmarked":null,"liked":null,"tags":[],"like_count":1,"views":1271,"category_id":15,"featured_link":null,"has_accepted_answer":false,"posters":[{"extras":null,"description":"Original Poster","user":{"id":11989,"username":"gbeuzeboc","name":"","avatar_template":"/letter_avatar/gbeuzeboc/{size}/5_6d6f4cde2641c35611d5cac2fb97c77e.png"}},{"extras":"latest","description":"Most Recent Poster","user":{"id":2772,"username":"degville","name":"Graham Morrison","avatar_template":"/user_avatar/forum.snapcraft.io/degville/{size}/2021_2.png"}}]},{"id":35223,"title":"How to perform a reboot from a snap with strict confinement","fancy_title":"How to perform a reboot from a snap with strict confinement","slug":"how-to-perform-a-reboot-from-a-snap-with-strict-confinement","posts_count":3,"reply_count":1,"highest_post_number":3,"image_url":null,"created_at":"2023-05-19T14:33:58.466Z","last_posted_at":"2023-05-21T10:37:46.676Z","bumped":true,"bumped_at":"2023-05-21T10:37:46.676Z","archetype":"regular","unseen":false,"pinned":false,"unpinned":null,"visible":true,"closed":false,"archived":false,"bookmarked":null,"liked":null,"tags":[],"like_count":3,"views":106,"category_id":15,"featured_link":null,"has_accepted_answer":false,"posters":[{"extras":null,"description":"Original Poster","user":{"id":14015,"username":"dboddie","name":"David Boddie","avatar_template":"/user_avatar/forum.snapcraft.io/dboddie/{size}/9564_2.png"}},{"extras":"latest","description":"Most Recent Poster","user":{"id":14590,"username":"apklu","name":"Arjun Suhass","avatar_template":"/letter_avatar/apklu/{size}/5_6d6f4cde2641c35611d5cac2fb97c77e.png"}}]}],"tags":[],"id":32266,"title":"GTK4 applications","fancy_title":"GTK4 applications","posts_count":3,"created_at":"2022-10-20T15:46:22.706Z","views":940,"reply_count":1,"like_count":0,"last_posted_at":"2023-05-02T08:10:16.531Z","visible":true,"closed":false,"archived":false,"has_summary":false,"archetype":"regular","slug":"gtk4-applications","category_id":15,"word_count":1976,"deleted_at":null,"user_id":2772,"featured_link":null,"pinned_globally":false,"pinned_at":null,"pinned_until":null,"image_url":null,"slow_mode_seconds":0,"draft":null,"draft_key":"topic_32266","draft_sequence":null,"unpinned":null,"pinned":false,"current_post_number":1,"highest_post_number":3,"deleted_by":null,"actions_summary":[{"id":4,"count":0,"hidden":false,"can_act":false},{"id":8,"count":0,"hidden":false,"can_act":false},{"id":7,"count":0,"hidden":false,"can_act":false}],"chunk_size":20,"bookmarked":false,"topic_timer":null,"message_bus_last_id":0,"participant_count":2,"show_read_indicator":false,"thumbnails":null,"details":{"notification_level":1,"participants":[{"id":2772,"username":"degville","name":"Graham Morrison","avatar_template":"/user_avatar/forum.snapcraft.io/degville/{size}/2021_2.png","post_count":2,"primary_group_name":null,"primary_group_flair_url":null,"primary_group_flair_color":null,"primary_group_flair_bg_color":null},{"id":13169,"username":"SamAlex","name":"","avatar_template":"/user_avatar/forum.snapcraft.io/samalex/{size}/9155_2.png","post_count":1,"primary_group_name":null,"primary_group_flair_url":null,"primary_group_flair_color":null,"primary_group_flair_bg_color":null}],"created_by":{"id":2772,"username":"degville","name":"Graham Morrison","avatar_template":"/user_avatar/forum.snapcraft.io/degville/{size}/2021_2.png"},"last_poster":{"id":2772,"username":"degville","name":"Graham Morrison","avatar_template":"/user_avatar/forum.snapcraft.io/degville/{size}/2021_2.png"},"links":[{"url":"https://dashboard.snapcraft.io/dev/account/","title":null,"internal":false,"attachment":false,"reflection":false,"clicks":1,"user_id":2772,"domain":"dashboard.snapcraft.io","root_domain":"snapcraft.io"},{"url":"https://forum.snapcraft.io/t/creating-a-snap/6799","title":"Creating a snap","internal":true,"attachment":false,"reflection":false,"clicks":1,"user_id":2772,"domain":"forum.snapcraft.io","root_domain":"snapcraft.io"},{"url":"https://forum.snapcraft.io/t/gtk3-applications/13483/3","title":"GTK3 applications","internal":true,"attachment":false,"reflection":true,"clicks":1,"user_id":2772,"domain":"forum.snapcraft.io","root_domain":"snapcraft.io"},{"url":"https://github.com/ubuntu/gnome-text-editor/blob/stable/snap/snapcraft.yaml","title":null,"internal":false,"attachment":false,"reflection":false,"clicks":1,"user_id":2772,"domain":"github.com","root_domain":"github.com"}]}}