{"post_stream":{"posts":[{"id":122337,"name":"Mateus Rodrigues de Morais","username":"mateus-morais","avatar_template":"/user_avatar/forum.snapcraft.io/mateus-morais/{size}/9752_2.png","created_at":"2023-04-13T17:19:06.475Z","cooked":"\u003cp\u003eThe .NET toolchain makes it easy for developers to build and publish applications. However, end user discovery and update management remain a challenge. Snap helps fill this gap by letting developers distribute applications and its updates in an app store experience for end users.\u003c/p\u003e\n\u003ch3\u003eWhy are snaps good for .NET projects?\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eSnaps are easy to discover and install\u003c/strong\u003e Millions of users can browse and install snaps graphically in the Snap Store or from the command-line.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eSnaps install and run the same across Linux\u003c/strong\u003e They bundle the exact version of .NET required, along with all of your app’s dependencies, be they .NET DLLs or system libraries.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eSnaps automatically update to the latest version\u003c/strong\u003e Four times a day, users’ systems will check for new versions and upgrade in the background.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eUpgrades are not disruptive\u003c/strong\u003e Because upgrades are not in-place, users can keep your app open as it’s upgraded in the background.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eUpgrades are safe\u003c/strong\u003e If your app fails to upgrade, users automatically roll back to the previous version.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eBuild a snap in 20 minutes\u003c/h3\u003e\n\u003cp\u003eReady to get started? By the end of this guide, you’ll understand how to make a snap of your .NET app that can be published in the \u003ca href=\"https://snapcraft.io/store\" rel=\"noopener nofollow ugc\"\u003eSnap Store\u003c/a\u003e, showcasing it to millions of Linux users.\u003c/p\u003e\n\u003cp\u003eSnapcraft overview: For a brief overview of the snap creation process, including how to install snapcraft and how it’s used, see \u003ca href=\"https://snapcraft.io/docs/snapcraft-overview\" rel=\"noopener nofollow ugc\"\u003eSnapcraft overview\u003c/a\u003e. For a more comprehensive breakdown of the steps involved, take a look at \u003ca href=\"https://snapcraft.io/docs/creating-a-snap\" rel=\"noopener nofollow ugc\"\u003eCreating a snap\u003c/a\u003e.\u003c/p\u003e\n\u003cdiv class=\"p-notification--positive\"\u003e\n\u003cdiv class=\"p-notification__response\"\u003e\n\u003cspan class=\"p-notification__status\"\u003e\nSnapcraft overview: \u003c/span\u003e\n\u003cp\u003eFor a brief overview of the snap creation process, including how to install snapcraft and how it’s used, see \u003ca href=\"https://snapcraft.io/docs/snapcraft-overview\" rel=\"noopener nofollow ugc\"\u003eSnapcraft overview\u003c/a\u003e. For a more comprehensive breakdown of the steps involved, take a look at \u003ca href=\"https://snapcraft.io/docs/creating-a-snap\" rel=\"noopener nofollow ugc\"\u003eCreating a snap\u003c/a\u003e.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003ch2\u003eGetting started\u003c/h2\u003e\n\u003cp\u003eSnaps are defined in a single YAML file placed in the root folder of your project. A complete reference of the available options for this file can be found in the \u003ca href=\"https://snapcraft.io/docs/snapcraft-yaml-reference\" rel=\"noopener nofollow ugc\"\u003eSnapcraft.yaml reference\u003c/a\u003e. The following example shows the entire snapcraft.yaml file for an existing project, \u003ca href=\"https://github.com/snapcraft-docs/whatime\" rel=\"noopener nofollow ugc\"\u003ewhatime\u003c/a\u003e. Don’t worry, we’ll break this down.\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-yaml\"\u003ename: whatime\nversion: '1.0.0'\ngrade: devel\nsummary: Get the current time in various cities around the world\ndescription: |\n  Whatime is able to get you the current time in several different cities\n  around the world.\n\nbase: core22\n\nconfinement: devmode\n\nparts:\n  whatime:\n    plugin: dotnet\n    dotnet-build-configuration: Release\n    dotnet-self-contained-runtime-identifier: linux-x64\n    source: .\n    build-packages:\n      - dotnet-sdk-6.0\n    stage-packages:\n      - libicu70\n\napps:\n  whatime:\n    command: Whatime\n\u003c/code\u003e\u003c/pre\u003e\n\u003ch3\u003eMetadata\u003c/h3\u003e\n\u003cp\u003eThe \u003ccode\u003esnapcraft.yaml\u003c/code\u003e file starts with a small amount of human-readable metadata, which usually can be lifted from the GitHub description of the project README.md. This data is used in the presentation of your app in the Snap Store.\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-yaml\"\u003ename: whatime\nversion: '1.0.0'\ngrade: devel\nsummary: Get the current time in various cities around the world\ndescription: |\n  Whatime is able to get you the current time in several different cities\n  around the world.\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eThe \u003ccode\u003ename\u003c/code\u003e must be unique in the Snap Store. Valid snap names consist of lower-case alphanumeric characters and hyphens. They cannot be all numbers and they also cannot start or end with a hyphen.\u003c/p\u003e\n\u003cp\u003eThe \u003ccode\u003eversion\u003c/code\u003e is a user facing version to be displayed. You can also specify \u003ccode\u003egit\u003c/code\u003e for the version, which will use the current git tag or commit as the version string. Versions carry no semantic meaning in snaps.\u003c/p\u003e\n\u003cp\u003eThe \u003ccode\u003egrade\u003c/code\u003e is an optional key that defines the quality grade of the snap. If can be either \u003ccode\u003edevel\u003c/code\u003e, which means it’s a development version of the snap, so not to be published to the \u003ccode\u003estable\u003c/code\u003e or \u003ccode\u003ecandidate\u003c/code\u003e channels, or \u003ccode\u003estable\u003c/code\u003e, which can be released to all channels.\u003c/p\u003e\n\u003cp\u003eThe \u003ccode\u003esummary\u003c/code\u003e can not exceed 79 characters. You can use the pipe symbol ‘|’ in the description key to declare a multi-line description.\u003c/p\u003e\n\u003ch3\u003eBase\u003c/h3\u003e\n\u003cp\u003eThe base keyword declares which \u003cem\u003ebase snap\u003c/em\u003e to use with your project. A base snap is a special kind of snap that provides a run-time environment alongside a minimal set of libraries that are common to most applications.\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-yaml\"\u003ebase: core22\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eAs used above, \u003ccode\u003ecore22\u003c/code\u003e is based on \u003ca href=\"https://releases.ubuntu.com/22.04/\" rel=\"noopener nofollow ugc\"\u003eUbuntu 22.04 LTS\u003c/a\u003e. See \u003ca href=\"https://snapcraft.io/docs/base-snaps\" rel=\"noopener nofollow ugc\"\u003eBase snaps\u003c/a\u003e for more details.\u003c/p\u003e\n\u003ch3\u003eSecurity model\u003c/h3\u003e\n\u003cp\u003eThe next section describes the level of confinement applied to your app.\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-yaml\"\u003econfinement: devmode\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eSnaps are containerized to ensure more predictable application behaviour and greater security. Unlike other container systems, the shape of this confinement can be changed through a set of interfaces. These are declarations that tell the system to give permission for a specific task, such as accessing a webcam or binding to a network port.\u003c/p\u003e\n\u003cp\u003eIt’s best to start a snap with the confinement in warning mode, rather than strictly applied. This is indicated through the \u003ccode\u003edevmode\u003c/code\u003e keyword. When a snap is in devmode, runtime confinement violations will be allowed but reported. These can be reviewed by running \u003ccode\u003ejournalctl -xe\u003c/code\u003e.\u003c/p\u003e\n\u003cp\u003eBecause devmode is only intended for development, snaps must be set to strict confinement before they can be published as “stable” in the Snap Store. Once an app is working well in devmode, you can review confinement violations, add appropriate interfaces, and switch to strict confinement.\u003c/p\u003e\n\u003cp\u003eThe above example will also work if you change \u003ccode\u003edevmode\u003c/code\u003e to \u003ccode\u003estrict\u003c/code\u003e, as you would before a release.\u003c/p\u003e\n\u003ch3\u003eParts\u003c/h3\u003e\n\u003cp\u003eParts define what sources are needed to assemble your app. Parts can be anything: programs, libraries, or other needed assets, but for now, we’re only going to use one part: the \u003cem\u003ewhatime\u003c/em\u003e source code in the local directory. In other cases, these can point to remote git repositories or tarballs.\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-yaml\"\u003eparts:\n  whatime:\n    plugin: dotnet\n    dotnet-build-configuration: Release\n    dotnet-self-contained-runtime-identifier: linux-x64\n    source: .\n    build-packages:\n      - dotnet-sdk-6.0\n    stage-packages:\n      - libicu70\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eThe \u003ccode\u003edotnet\u003c/code\u003e plugin can be used in .NET projects to install dependencies via the \u003ca href=\"https://www.nuget.org/\" rel=\"noopener nofollow ugc\"\u003eNuGet\u003c/a\u003e package manager, compile the application, and publish it. Optionally, the following parameters can also be defined:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003ccode\u003edotnet-build-configuration\u003c/code\u003e: The .NET build configuration to use. Defaults to Release.\u003c/li\u003e\n\u003cli\u003e\n\u003ccode\u003edotnet-self-contained-runtime-identifier\u003c/code\u003e: Optional parameter to specify the runtime identifier to use when building a self-contained application. Setting this parameter will automatically trigger a self-contained build (with the \u003ccode\u003e--self-contained\u003c/code\u003e flag on the \u003ccode\u003edotnet publish\u003c/code\u003e command).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cdiv class=\"p-notification--important\"\u003e\n\u003cdiv class=\"p-notification__response\"\u003e\n\u003cspan class=\"p-notification__status\"\u003e\nSingle file publishing: \u003c/span\u003e\n\u003cp\u003eThe output of the deployment should contain the executable file along with all the necessary DLLs and dependencies necessary to run it. If you want to deploy your application as a single-file executable, you should set the following parameter inside the \u003ccode\u003e.csproj\u003c/code\u003e file of your project:\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-xml\"\u003e\u0026lt;PropertyGroup\u0026gt;\n   …\n   \u0026lt;PublishSingleFile\u0026gt;true\u0026lt;/PublishSingleFile\u0026gt;\n\u0026lt;/PropertyGroup\u0026gt;\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eBy doing this, the parameter \u003ccode\u003edotnet-self-contained-runtime-identifier\u003c/code\u003e becomes required, since a runtime identifier is required to build a single-file .NET executable.\u003c/p\u003e\n\u003c/div\u003e\n\u003c/div\u003e\n\u003cp\u003eThe \u003ccode\u003esource\u003c/code\u003e should point to the root of your .NET project. In our case, it points to the local directory as it’s where the source tree is located. It can also point to a URL if the source code is available as a compressed archive or a revision control repository.\u003c/p\u003e\n\u003cp\u003eYou should also use \u003ccode\u003ebuild-packages\u003c/code\u003e to list any required package during build time. We are listing the dotnet-sdk-6.0 package as it instals the .NET 6 SDK, which is required by the plugin and does not get installed automatically.\u003c/p\u003e\n\u003cp\u003eThe \u003ccode\u003estage-packages\u003c/code\u003e directive is used to list any required packages during run time. In our case, the libicu70 is a required system package to run the .NET application.\u003c/p\u003e\n\u003ch3\u003eApps\u003c/h3\u003e\n\u003cp\u003eApps are the commands you want to expose to users and any background services your application provides. Each key under \u003ccode\u003eapps\u003c/code\u003e is the command name that should be made available on users’ systems.\u003c/p\u003e\n\u003cp\u003eThe \u003ccode\u003ecommand\u003c/code\u003e specifies the full path to the binary to be run. This is resolved relative to the root of your snap contents.\u003c/p\u003e\n\u003cpre\u003e\u003ccode class=\"lang-yaml\"\u003eapps:\nwhatime:\ncommand: Whatime\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eIf your command name matches the snap \u003ccode\u003ename\u003c/code\u003e, users will be able to run the command directly. If the names differ, then apps are prefixed with the snap name (\u003ccode\u003ewhatime.command-name\u003c/code\u003e, for example). This is to avoid conflicting with apps defined by other installed snaps.\u003c/p\u003e\n\u003cp\u003eYou can request an alias on the \u003ca href=\"https://snapcraft.io/docs/process-for-aliases-auto-connections-and-tracks\" rel=\"noopener nofollow ugc\"\u003eSnapcraft forum\u003c/a\u003e if your command name and snap name do not match but you don’t want your command prefixed. These aliases are set up automatically when your snap is installed from the Snap Store.\u003c/p\u003e\n\u003ch2\u003eBuilding the snap\u003c/h2\u003e\n\u003cp\u003eYou can download the example repository with the following command\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e$ git clone https://github.com/mateusrodrigues/whatime.git\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eAfter you’ve created the \u003cem\u003esnapcraft.yaml\u003c/em\u003e (which already exists in the above repository), you can build the snap by simply executing the \u003ccode\u003esnapcraft\u003c/code\u003e command in the project directory:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e$ snapcraft\nLaunching instance…\nExecuted: pull whatime\nExecuted: overlay whatime\nExecuted: build whatime\nExecuted: stage whatime\nExecuted: prime whatime\nExecuted parts lifecycle\nGenerated snap metadata\nCreated snap package whatime_1.0.0_amd64.snap\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eThe resulting snap can be installed locally. This requires the \u003ccode\u003e--dangerous\u003c/code\u003e flag because the snap is not signed by the Snap Store. The \u003ccode\u003e--devmode\u003c/code\u003e flag acknowledges that you are installing an unconfined application:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e$ sudo snap install whatime_1.0.0_amd64.snap --devmode --dangerous\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eYou can then try it out:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e$ whatime --help\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eRemoving the snap is simple too:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e$ sudo snap remove whatime\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eYou can also clean up the build environment, although this will slow down the next initial build:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e$ snapcraft clean\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eBy default, when you make a change to snapcraft.yaml, snapcraft only builds the parts that have changed. Cleaning a build, however, forces your snap to be rebuilt in a clean environment and will take longer.\u003c/p\u003e\n\u003ch2\u003ePublishing your snap\u003c/h2\u003e\n\u003cp\u003eTo share your snaps, you need to publish them in the Snap Store. First, create an account on \u003ca href=\"https://dashboard.snapcraft.io/dev/account/\" rel=\"noopener nofollow ugc\"\u003ethe dashboard\u003c/a\u003e. Here you can customise how your snaps are presented, review your uploads, and control publishing.\u003c/p\u003e\n\u003cp\u003eYou’ll need to choose a unique “developer namespace” as part of the account creation process. This name will be visible by users and associated with your published snaps.\u003c/p\u003e\n\u003cp\u003eMake sure the \u003ccode\u003esnapcraft\u003c/code\u003e command is authenticated using the email address attached to your Snap Store account.\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e$ snapcraft login\n\u003c/code\u003e\u003c/pre\u003e\n\u003ch3\u003eReserve a name for your snap\u003c/h3\u003e\n\u003cp\u003eYou can publish your own version of a snap, provided you do so under a name you have rights to. You can register a name on \u003ca href=\"https://dashboard.snapcraft.io/register-snap/\" rel=\"noopener nofollow ugc\"\u003edashboard.snapcraft.io\u003c/a\u003e, or by running the following command:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e$ snapcraft register mydotnetapp\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eBe sure to update the \u003ccode\u003ename:\u003c/code\u003e in your \u003ccode\u003esnapcraft.yaml\u003c/code\u003e to match this registered name, then run \u003ccode\u003esnapcraft\u003c/code\u003e again.\u003c/p\u003e\n\u003ch3\u003eUpload your snap\u003c/h3\u003e\n\u003cp\u003eUse snapcraft to push the snap to the Snap Store.\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e$ snapcraft upload --release=edge mydotnetapp_*.snap\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eIf you’re happy with the result, you can commit the snapcraft.yaml to your GitHub repo and \u003ca href=\"https://build.snapcraft.io/\" rel=\"noopener nofollow ugc\"\u003eturn on automatic builds\u003c/a\u003e so any further commits automatically get released to edge, without requiring you to manually build locally.\u003c/p\u003e\n\u003cp\u003eCongratulations! You’ve just built and published your first .NET snap. For a more in-depth overview of the snap building process, see \u003ca href=\"https://snapcraft.io/docs/creating-a-snap\" rel=\"noopener nofollow ugc\"\u003eCreating a snap\u003c/a\u003e.\u003c/p\u003e","post_number":1,"post_type":1,"updated_at":"2023-05-30T14:53:47.897Z","reply_count":1,"reply_to_post_number":null,"quote_count":0,"incoming_link_count":8,"reads":8,"readers_count":7,"score":106.6,"yours":false,"topic_id":34730,"topic_slug":"net-apps","display_username":"Mateus Rodrigues de Morais","primary_group_name":null,"primary_group_flair_url":null,"primary_group_flair_bg_color":null,"primary_group_flair_color":null,"version":3,"can_edit":false,"can_delete":false,"can_recover":false,"can_wiki":false,"link_counts":[{"url":"https://snapcraft.io/store","internal":false,"reflection":false,"title":"Install Linux apps using the Snap Store | Snapcraft","clicks":1},{"url":"https://build.snapcraft.io/","internal":false,"reflection":false,"clicks":0},{"url":"https://dashboard.snapcraft.io/register-snap/","internal":false,"reflection":false,"clicks":0},{"url":"https://dashboard.snapcraft.io/dev/account/","internal":false,"reflection":false,"clicks":0},{"url":"https://snapcraft.io/docs/process-for-aliases-auto-connections-and-tracks","internal":false,"reflection":false,"clicks":0},{"url":"https://www.nuget.org/","internal":false,"reflection":false,"clicks":0},{"url":"https://snapcraft.io/docs/base-snaps","internal":false,"reflection":false,"clicks":0},{"url":"https://releases.ubuntu.com/22.04/","internal":false,"reflection":false,"title":"Ubuntu 22.04.2 LTS (Jammy Jellyfish)","clicks":0},{"url":"https://github.com/snapcraft-docs/whatime","internal":false,"reflection":false,"clicks":0},{"url":"https://snapcraft.io/docs/snapcraft-yaml-reference","internal":false,"reflection":false,"clicks":0},{"url":"https://snapcraft.io/docs/creating-a-snap","internal":false,"reflection":false,"title":"Creating a snap | Snapcraft documentation","clicks":0},{"url":"https://snapcraft.io/docs/snapcraft-overview","internal":false,"reflection":false,"title":"Snapcraft overview | Snapcraft documentation","clicks":0},{"url":"https://forum.snapcraft.io/t/snap-documentation/11127","internal":true,"reflection":true,"title":"Snap documentation","clicks":0},{"url":"https://forum.snapcraft.io/t/creating-a-snap/6799","internal":true,"reflection":true,"title":"Creating a snap","clicks":0}],"read":true,"user_title":null,"bookmarked":false,"actions_summary":[{"id":2,"count":2}],"moderator":false,"admin":false,"staff":false,"user_id":14372,"hidden":false,"trust_level":1,"deleted_at":null,"user_deleted":false,"edit_reason":null,"can_view_edit_history":true,"wiki":false,"can_accept_answer":false,"can_unaccept_answer":false,"accepted_answer":false},{"id":124221,"name":"Vasyl Vavrychuk","username":"vvavrychuk","avatar_template":"/user_avatar/forum.snapcraft.io/vvavrychuk/{size}/9864_2.png","created_at":"2023-05-29T06:08:55.544Z","cooked":"\u003cp\u003eAs discussed in \u003ca href=\"https://forum.snapcraft.io/t/apps-command-path-is-not-searched-relative-to-usr-bin/35346/5\" class=\"inline-onebox\"\u003eApps command path is not searched relative to usr/bin\u003c/a\u003e, replace\u003c/p\u003e\n\u003caside class=\"quote no-group\" data-username=\"mateus-morais\" data-post=\"1\" data-topic=\"34730\"\u003e\n\u003cdiv class=\"title\"\u003e\n\u003cdiv class=\"quote-controls\"\u003e\u003c/div\u003e\n\u003cimg alt=\"\" width=\"20\" height=\"20\" src=\"https://forum.snapcraft.io/user_avatar/forum.snapcraft.io/mateus-morais/40/9752_2.png\" class=\"avatar\"\u003e mateus-morais:\u003c/div\u003e\n\u003cblockquote\u003e\n\u003cp\u003eThis is resolved to the root of your snap contents and automatically searches in the \u003ccode\u003eusr/sbin\u003c/code\u003e, \u003ccode\u003eusr/bin\u003c/code\u003e, \u003ccode\u003esbin\u003c/code\u003e, and \u003ccode\u003ebin\u003c/code\u003e sub directories of your snap.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003c/aside\u003e\n\u003cp\u003ewith\u003c/p\u003e\n\u003caside class=\"quote no-group\"\u003e\n\u003cblockquote\u003e\n\u003cp\u003eThis is resolved relative to the root of your snap contents.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003c/aside\u003e","post_number":2,"post_type":1,"updated_at":"2023-05-29T06:09:04.074Z","reply_count":0,"reply_to_post_number":null,"quote_count":1,"incoming_link_count":0,"reads":4,"readers_count":3,"score":45.8,"yours":false,"topic_id":34730,"topic_slug":"net-apps","display_username":"Vasyl Vavrychuk","primary_group_name":null,"primary_group_flair_url":null,"primary_group_flair_bg_color":null,"primary_group_flair_color":null,"version":1,"can_edit":false,"can_delete":false,"can_recover":false,"can_wiki":false,"link_counts":[{"url":"https://forum.snapcraft.io/t/apps-command-path-is-not-searched-relative-to-usr-bin/35346/5","internal":true,"reflection":false,"title":"Apps command path is not searched relative to usr/bin","clicks":0}],"read":true,"user_title":null,"bookmarked":false,"actions_summary":[{"id":2,"count":1}],"moderator":false,"admin":false,"staff":false,"user_id":14625,"hidden":false,"trust_level":2,"deleted_at":null,"user_deleted":false,"edit_reason":null,"can_view_edit_history":true,"wiki":false,"can_accept_answer":false,"can_unaccept_answer":false,"accepted_answer":false}],"stream":[122337,124221]},"timeline_lookup":[[1,63],[2,18]],"suggested_topics":[{"id":30982,"title":"The acrn interface","fancy_title":"The acrn interface","slug":"the-acrn-interface","posts_count":3,"reply_count":1,"highest_post_number":3,"image_url":null,"created_at":"2022-07-21T14:25:57.164Z","last_posted_at":"2022-08-05T17:30:59.540Z","bumped":true,"bumped_at":"2022-08-05T17:30:59.540Z","archetype":"regular","unseen":false,"pinned":false,"unpinned":null,"visible":true,"closed":false,"archived":false,"bookmarked":null,"liked":null,"tags":[],"like_count":1,"views":1003,"category_id":15,"featured_link":null,"has_accepted_answer":false,"posters":[{"extras":"latest","description":"Original Poster, Most Recent Poster","user":{"id":2772,"username":"degville","name":"Graham Morrison","avatar_template":"/user_avatar/forum.snapcraft.io/degville/{size}/2021_2.png"}},{"extras":null,"description":"Frequent Poster","user":{"id":9753,"username":"gvancuts","name":"Geoffroy","avatar_template":"/letter_avatar/gvancuts/{size}/5_6d6f4cde2641c35611d5cac2fb97c77e.png"}}]},{"id":33078,"title":"Build and publishing example","fancy_title":"Build and publishing example","slug":"build-and-publishing-example","posts_count":5,"reply_count":1,"highest_post_number":5,"image_url":null,"created_at":"2022-12-13T13:17:46.677Z","last_posted_at":"2023-05-31T16:11:13.715Z","bumped":true,"bumped_at":"2023-05-31T16:11:13.715Z","archetype":"regular","unseen":false,"pinned":false,"unpinned":null,"visible":true,"closed":false,"archived":false,"bookmarked":null,"liked":null,"tags":[],"like_count":1,"views":728,"category_id":15,"featured_link":null,"has_accepted_answer":false,"posters":[{"extras":null,"description":"Original Poster","user":{"id":2772,"username":"degville","name":"Graham Morrison","avatar_template":"/user_avatar/forum.snapcraft.io/degville/{size}/2021_2.png"}},{"extras":"latest","description":"Most Recent Poster","user":{"id":14652,"username":"jh-slack","name":"Jade Ho","avatar_template":"/letter_avatar/jh-slack/{size}/5_6d6f4cde2641c35611d5cac2fb97c77e.png"}}]},{"id":34740,"title":"Super-privileged interfaces","fancy_title":"Super-privileged interfaces","slug":"super-privileged-interfaces","posts_count":1,"reply_count":0,"highest_post_number":1,"image_url":null,"created_at":"2023-04-14T09:20:24.510Z","last_posted_at":"2023-04-14T09:20:24.656Z","bumped":true,"bumped_at":"2023-04-14T09:29:53.927Z","archetype":"regular","unseen":false,"pinned":false,"unpinned":null,"visible":true,"closed":false,"archived":false,"bookmarked":null,"liked":null,"tags":[],"like_count":0,"views":260,"category_id":15,"featured_link":null,"has_accepted_answer":false,"posters":[{"extras":"latest single","description":"Original Poster, Most Recent Poster","user":{"id":2772,"username":"degville","name":"Graham Morrison","avatar_template":"/user_avatar/forum.snapcraft.io/degville/{size}/2021_2.png"}}]},{"id":34026,"title":"Tutorial is outdated or something","fancy_title":"Tutorial is outdated or something","slug":"tutorial-is-outdated-or-something","posts_count":4,"reply_count":1,"highest_post_number":4,"image_url":null,"created_at":"2023-02-23T15:15:25.641Z","last_posted_at":"2023-02-23T17:40:48.223Z","bumped":true,"bumped_at":"2023-02-23T17:40:48.223Z","archetype":"regular","unseen":false,"pinned":false,"unpinned":null,"visible":true,"closed":false,"archived":false,"bookmarked":null,"liked":null,"tags":[],"like_count":1,"views":123,"category_id":15,"featured_link":null,"has_accepted_answer":false,"posters":[{"extras":"latest","description":"Original Poster, Most Recent Poster","user":{"id":14103,"username":"Greg","name":"Greg Timmons","avatar_template":"/letter_avatar/greg/{size}/5_6d6f4cde2641c35611d5cac2fb97c77e.png"}},{"extras":null,"description":"Frequent Poster","user":{"id":11310,"username":"mr_cal","name":"Callahan Kovacs","avatar_template":"/user_avatar/forum.snapcraft.io/mr_cal/{size}/8466_2.png"}},{"extras":null,"description":"Frequent Poster","user":{"id":2772,"username":"degville","name":"Graham Morrison","avatar_template":"/user_avatar/forum.snapcraft.io/degville/{size}/2021_2.png"}}]},{"id":31051,"title":"Snapcraft Reference","fancy_title":"Snapcraft Reference","slug":"snapcraft-reference","posts_count":5,"reply_count":1,"highest_post_number":5,"image_url":null,"created_at":"2022-07-27T11:51:00.654Z","last_posted_at":"2023-04-24T17:52:24.772Z","bumped":true,"bumped_at":"2023-04-25T05:31:27.608Z","archetype":"regular","unseen":false,"pinned":false,"unpinned":null,"visible":true,"closed":false,"archived":false,"bookmarked":null,"liked":null,"tags":[],"like_count":0,"views":1238,"category_id":15,"featured_link":null,"has_accepted_answer":false,"posters":[{"extras":null,"description":"Original Poster","user":{"id":2772,"username":"degville","name":"Graham Morrison","avatar_template":"/user_avatar/forum.snapcraft.io/degville/{size}/2021_2.png"}},{"extras":null,"description":"Frequent Poster","user":{"id":14015,"username":"dboddie","name":"David Boddie","avatar_template":"/user_avatar/forum.snapcraft.io/dboddie/{size}/9564_2.png"}},{"extras":null,"description":"Frequent Poster","user":{"id":11710,"username":"rpjday","name":"Robert P. J. Day","avatar_template":"/user_avatar/forum.snapcraft.io/rpjday/{size}/8457_2.png"}},{"extras":"latest","description":"Most Recent Poster","user":{"id":2185,"username":"abitrolly","name":"Anatoli Babenia","avatar_template":"/user_avatar/forum.snapcraft.io/abitrolly/{size}/4528_2.png"}}]}],"tags":[],"id":34730,"title":".NET apps","fancy_title":".NET apps","posts_count":2,"created_at":"2023-04-13T17:19:06.288Z","views":300,"reply_count":0,"like_count":3,"last_posted_at":"2023-05-29T06:08:55.544Z","visible":true,"closed":false,"archived":false,"has_summary":false,"archetype":"regular","slug":"net-apps","category_id":15,"word_count":2001,"deleted_at":null,"user_id":14372,"featured_link":null,"pinned_globally":false,"pinned_at":null,"pinned_until":null,"image_url":null,"slow_mode_seconds":0,"draft":null,"draft_key":"topic_34730","draft_sequence":null,"unpinned":null,"pinned":false,"current_post_number":1,"highest_post_number":2,"deleted_by":null,"actions_summary":[{"id":4,"count":0,"hidden":false,"can_act":false},{"id":8,"count":0,"hidden":false,"can_act":false},{"id":7,"count":0,"hidden":false,"can_act":false}],"chunk_size":20,"bookmarked":false,"topic_timer":null,"message_bus_last_id":0,"participant_count":2,"show_read_indicator":false,"thumbnails":null,"details":{"notification_level":1,"participants":[{"id":14372,"username":"mateus-morais","name":"Mateus Rodrigues de Morais","avatar_template":"/user_avatar/forum.snapcraft.io/mateus-morais/{size}/9752_2.png","post_count":1,"primary_group_name":null,"primary_group_flair_url":null,"primary_group_flair_color":null,"primary_group_flair_bg_color":null},{"id":14625,"username":"vvavrychuk","name":"Vasyl Vavrychuk","avatar_template":"/user_avatar/forum.snapcraft.io/vvavrychuk/{size}/9864_2.png","post_count":1,"primary_group_name":null,"primary_group_flair_url":null,"primary_group_flair_color":null,"primary_group_flair_bg_color":null}],"created_by":{"id":14372,"username":"mateus-morais","name":"Mateus Rodrigues de Morais","avatar_template":"/user_avatar/forum.snapcraft.io/mateus-morais/{size}/9752_2.png"},"last_poster":{"id":14625,"username":"vvavrychuk","name":"Vasyl Vavrychuk","avatar_template":"/user_avatar/forum.snapcraft.io/vvavrychuk/{size}/9864_2.png"},"links":[{"url":"https://snapcraft.io/store","title":"Install Linux apps using the Snap Store | Snapcraft","internal":false,"attachment":false,"reflection":false,"clicks":1,"user_id":14372,"domain":"snapcraft.io","root_domain":"snapcraft.io"}]}}